src/test/resources/mock-responses/test/default-response-invalid.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header />
	<soapenv:Body>
		<test xmlns="http://www.example.org/schema">
			<number>0</number>
			<text>text</text>
		</testXX>
	</soapenv:Body>
</soapenv:Envelope>
